using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class SaveGenerator : MonoBehaviour
{
    public void Save()
    {
        /*
        1.местоположения игрока:
            просто Vector2


        2.все инвентари игрока:
            список инвентарей;
                дату каждого предмета;
                его тип;
                

        3.все инвентари всех хранилишь(сундуки/ тайники):
                дату каждого предмета;
                его тип;


        4.местоположение всех противников:
            тип противника;
            его положение vec3;
        */

        //альт варик: просто запихать все объекты на сцене в скрипт. обдж. , как список гей обдж.
    }

    public void Load()
    {
        /*
         удалить сцену, которая загружена сейчас 
         задгрулить дату, которую сохранил
        */ 
    }
}
